12/data/attachments/27dfb63f2472e9c2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Brandon_each_Friend_14101_1</nif:username>
            <nif:friendToBeRequested>soap_friends_b7f4e6c3-6c53-40f1-a19a-ae8fcadefb5c</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>